In [2]:
import numpy as np
np.linspace(-3,3)

array([-3.        , -2.87755102, -2.75510204, -2.63265306, -2.51020408,
       -2.3877551 , -2.26530612, -2.14285714, -2.02040816, -1.89795918,
       -1.7755102 , -1.65306122, -1.53061224, -1.40816327, -1.28571429,
       -1.16326531, -1.04081633, -0.91836735, -0.79591837, -0.67346939,
       -0.55102041, -0.42857143, -0.30612245, -0.18367347, -0.06122449,
        0.06122449,  0.18367347,  0.30612245,  0.42857143,  0.55102041,
        0.67346939,  0.79591837,  0.91836735,  1.04081633,  1.16326531,
        1.28571429,  1.40816327,  1.53061224,  1.65306122,  1.7755102 ,
        1.89795918,  2.02040816,  2.14285714,  2.26530612,  2.3877551 ,
        2.51020408,  2.63265306,  2.75510204,  2.87755102,  3.        ])

In [ ]:
array=np.linspace(-3,3,num=100)
array*10

In [8]:
np.random.randint(50,high=101,size=10)

array([89, 76, 63, 96, 93, 94, 92, 87, 90, 62])

In [11]:
content=np.random.randint(50,high=101,size=(50,5))

In [ ]:
import pandas as pd
df1=pd.DataFrame(data=content,index=[f"第{i}號" for i in range(1,51)],columns=["國","英","數","理","化"])
df1

In [ ]:
df1["國"]+df1["英"]+df1["數"]+df1["理"]+df1["化"]

In [18]:
df1.loc["第1號"]

國    58
英    63
數    66
理    70
化    56
Name: 第1號, dtype: int64

In [20]:
df1.loc[["第1號","第5號","第10號"]]

       國   英   數   理   化
第1號   58  63  66  70  56
第5號   76  88  92  57  67
第10號  57  56  76  75  51

In [21]:
df1.iloc[:5]

      國   英   數   理   化
第1號  58  63  66  70  56
第2號  51  79  82  80  92
第3號  91  55  55  70  72
第4號  71  87  65  75  73
第5號  76  88  92  57  67

In [23]:
df1.loc["第6號":"第10號"]

       國   英   數   理   化
第6號   75  54  61  75  73
第7號   80  56  78  54  80
第8號   79  77  75  58  65
第9號   79  93  64  67  50
第10號  57  56  76  75  51